pnkmem433/pnk_kdh/smarthanger/IoT/251020_pnklabmem203_esp32p4_switchbox_PoC/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
# Camera I2C pins (ESP32-P4 GPIO, per WT99P4C5-S1 pinout: IO8=GPIO8, IO6/IO7 are also available)
# Reference: example/video_lcd_display and Development Board Guide Table 3
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_SCL_PIN=8
CONFIG_EXAMPLE_MIPI_CSI_SCCB_I2C_SDA_PIN=7
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_HOOK_IP6_INPUT_NONE=y
# Camera sensor: OV5647 (I2C address 0x36, not SC2336 0x30)
# Resolution: 1280x960 @ 45fps (memory optimized, 41% less than 1080p)
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_AUTO_DETECT=y
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
# CONFIG_CAMERA_OV5647_MIPI_RAW10_1920x1080_30FPS is not set
CONFIG_CAMERA_OV5647_MIPI_RAW10_1280x960_BINNING_45FPS=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
